[{
  "name": "Impacto Profundo (1998)",
  "description": "Catástrofe ambiental - Um cometa gigante está em rota de colisão com a Terra, ameaçando extinguir toda a vida. Enquanto governos tentam evitar o desastre com explosões nucleares, a população enfrenta o pânico e a luta pela sobrevivência."
},
{
  "name": "Twister (1996)",
  "description": "Catástrofe ambiental - Uma equipe de cientistas caça tornados para testar um sistema de alerta precoce. No meio de tempestades violentas, eles arriscam suas vidas para coletar dados que podem salvar milhares de pessoas no futuro."
},
{
  "name": "As Branquelas (2004)",
  "description": "Comédia - Dois agentes do FBI precisam se disfarçar de socialites para impedir um sequestro. O problema? Eles são péssimos em agir como patricinhas! O filme é repleto de situações absurdas e hilárias."
},
{
  "name": "Minha Mãe é uma Peça (2013)",
  "description": "Comédia - Dona Hermínia, uma mãe superprotetora e cheia de opiniões, decide sair de casa após ouvir os filhos reclamando dela. A comédia brasileira é um retrato divertido e emocionante da relação entre mães e filhos."
},
{
  "name": "O Homem de Toronto (2022)",
  "description": "Comédia - Um homem comum é confundido com um assassino profissional e acaba envolvido em uma missão perigosa. Com Kevin Hart e Woody Harrelson, o filme mistura ação e humor de forma eletrizante."
},
{
  "name": "A Chegada (2016)",
  "description": "Alienígena - Quando misteriosas naves alienígenas pousam na Terra, uma linguista é recrutada para decifrar sua linguagem e entender suas intenções. O filme explora comunicação, tempo e a natureza do entendimento entre espécies."
},
{
  "name": "Independence Day (1996)",
  "description": "Alienígena - A humanidade enfrenta uma invasão alienígena devastadora. Com cidades destruídas e forças militares em desvantagem, um grupo de sobreviventes se une para contra-atacar e salvar o planeta."
},
{
  "name": "Distrito 9 (2009)",
  "description": "Alienígena - Alienígenas chegam à Terra e são confinados em uma área precária na África do Sul. O filme aborda temas de segregação e preconceito, mostrando a luta de um agente que começa a se transformar em um dos extraterrestres."
},
{
  "name": "O Dia Depois de Amanhã (2004)",
  "description": "Catástrofe ambiental - Um climatologista descobre que o aquecimento global está desencadeando uma nova era glacial. Enquanto tempestades devastadoras assolam o planeta, ele embarca em uma jornada perigosa para salvar seu filho preso em Nova York."
},
{
  "name": "Rush - No Limite da Emoção (2013)",
  "description": "Corrida - Baseado na rivalidade real entre os pilotos James Hunt e Niki Lauda na Fórmula 1 dos anos 1970. O filme mostra os desafios, os perigos e a obsessão pela vitória, culminando na icônica temporada de 1976."
},
{
  "name": "Gran Turismo (2023)",
  "description": "Corrida - Inspirado na história real de um jogador de videogame que se torna piloto profissional. O filme acompanha a jornada de Jann Mardenborough, que sai das pistas virtuais para competir em corridas reais."
},
{
  "name": "Ford vs Ferrari (2019)",
  "description": "Corrida - A história da batalha entre Ford e Ferrari para vencer as 24 Horas de Le Mans em 1966. O engenheiro Carroll Shelby e o piloto Ken Miles enfrentam desafios técnicos e políticos para criar um carro capaz de derrotar a Ferrari."
},
{
  "name": "Batman: O Cavaleiro das Trevas (2008)",
  "description": "Super Heróis - O Coringa aterroriza Gotham com um plano caótico, forçando Batman a enfrentar dilemas morais enquanto tenta proteger a cidade. O filme é um dos mais aclamados do gênero, com uma atuação icônica de Heath Ledger como o vilão."
},
{
  "name": "Vingadores: Ultimato (2019)",
  "description": "Super Heróis - Após Thanos dizimar metade da vida no universo, os Vingadores embarcam em uma missão arriscada para reverter o desastre. O filme reúne heróis icônicos da Marvel em uma batalha épica pelo destino da humanidade."
},
{
  "name": "Homem-Aranha: No Aranhaverso (2018)",
  "description": "Super Heróis - Miles Morales descobre que pode ser o novo Homem-Aranha e precisa aprender a lidar com seus poderes enquanto enfrenta ameaças interdimensionais. A animação inovadora conquistou fãs com seu estilo visual único e narrativa envolvente."
}]